[Killed] BlockStatement
src/calculator/calculator.ts:2:37
 export class Calculator {
-  add(a: number, b: number): number {
-    return a + b;
-  }
+  add(a: number, b: number): number {}
 
   subtract(a: number, b: number): number {
killedBy: Calculator add should add two positive numbers correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/calculator/calculator.ts:3:12
 export class Calculator {
   add(a: number, b: number): number {
-    return a + b;
+    return a - b;
   }
 
killedBy: Calculator add should add two positive numbers correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1

[Killed] BlockStatement
src/calculator/calculator.ts:6:42
     return a + b;
   }
 
-  subtract(a: number, b: number): number {
-    return a - b;
-  }
+  subtract(a: number, b: number): number {}
 
   multiply(a: number, b: number): number {
killedBy: Calculator subtract should subtract numbers correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/calculator/calculator.ts:7:12
   }
 
   subtract(a: number, b: number): number {
-    return a - b;
+    return a + b;
   }
 
killedBy: Calculator subtract should subtract numbers correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 8

[Killed] BlockStatement
src/calculator/calculator.ts:10:42
     return a - b;
   }
 
-  multiply(a: number, b: number): number {
-    return a * b;
-  }
+  multiply(a: number, b: number): number {}
 
   divide(a: number, b: number): number {
killedBy: Calculator multiply should multiply numbers correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] ArithmeticOperator
src/calculator/calculator.ts:11:12
   }
 
   multiply(a: number, b: number): number {
-    return a * b;
+    return a / b;
   }
 
killedBy: Calculator multiply should multiply numbers correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0.75

[Killed] BlockStatement
src/calculator/calculator.ts:14:40
     return a * b;
   }
 
-  divide(a: number, b: number): number {
-    if (b === 0) {
-      throw new Error('Division by zero');
-    }
-    return a / b;
-  }
+  divide(a: number, b: number): number {}
 
   isEven(number: number): boolean {
killedBy: Calculator divide should divide numbers correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] EqualityOperator
src/calculator/calculator.ts:15:9
   }
 
   divide(a: number, b: number): number {
-    if (b === 0) {
+    if (b !== 0) {
       throw new Error('Division by zero');
     }
killedBy: Calculator divide should divide numbers correctly
statusReason: Error: Division by zero

[Killed] ConditionalExpression
src/calculator/calculator.ts:15:9
   }
 
   divide(a: number, b: number): number {
-    if (b === 0) {
+    if (false) {
       throw new Error('Division by zero');
     }
killedBy: Calculator divide should throw error when dividing by zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Division by zero"

Received function did not throw

[Killed] BlockStatement
src/calculator/calculator.ts:21:35
     return a / b;
   }
 
-  isEven(number: number): boolean {
-    return number % 2 === 0;
-  }
+  isEven(number: number): boolean {}
 
   factorial(n: number): number {
killedBy: Calculator isEven should return true for even numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/calculator/calculator.ts:22:12
   }
 
   isEven(number: number): boolean {
-    return number % 2 === 0;
+    return true;
   }
 
killedBy: Calculator isEven should return false for odd numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/calculator/calculator.ts:22:12
   }
 
   isEven(number: number): boolean {
-    return number % 2 === 0;
+    return number * 2 === 0;
   }
 
killedBy: Calculator isEven should return true for even numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/calculator/calculator.ts:25:32
     return number % 2 === 0;
   }
 
-  factorial(n: number): number {
-    if (n < 0) throw new Error('Negative numbers not allowed');
-    if (n === 0) return 1;
-    return n * this.factorial(n - 1);
-  }
+  factorial(n: number): number {}
 
   power(base: number, exponent: number): number {
killedBy: Calculator factorial should calculate factorial of 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
src/calculator/calculator.ts:26:9
   }
 
   factorial(n: number): number {
-    if (n < 0) throw new Error('Negative numbers not allowed');
+    if (n <= 0) throw new Error('Negative numbers not allowed');
     if (n === 0) return 1;
     return n * this.factorial(n - 1);
killedBy: Calculator factorial should calculate factorial of 0
statusReason: Error: Negative numbers not allowed

[Killed] ConditionalExpression
src/calculator/calculator.ts:26:9
   }
 
   factorial(n: number): number {
-    if (n < 0) throw new Error('Negative numbers not allowed');
+    if (true) throw new Error('Negative numbers not allowed');
     if (n === 0) return 1;
     return n * this.factorial(n - 1);
killedBy: Calculator factorial should calculate factorial of 0
statusReason: Error: Negative numbers not allowed

[Killed] ConditionalExpression
src/calculator/calculator.ts:27:9
 
   factorial(n: number): number {
     if (n < 0) throw new Error('Negative numbers not allowed');
-    if (n === 0) return 1;
+    if (true) return 1;
     return n * this.factorial(n - 1);
   }
killedBy: Calculator factorial should calculate factorial of 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
src/calculator/calculator.ts:27:9
 
   factorial(n: number): number {
     if (n < 0) throw new Error('Negative numbers not allowed');
-    if (n === 0) return 1;
+    if (n !== 0) return 1;
     return n * this.factorial(n - 1);
   }
killedBy: Calculator factorial should calculate factorial of 0
statusReason: Error: Negative numbers not allowed

[Killed] ArithmeticOperator
src/calculator/calculator.ts:28:12
   factorial(n: number): number {
     if (n < 0) throw new Error('Negative numbers not allowed');
     if (n === 0) return 1;
-    return n * this.factorial(n - 1);
+    return n / this.factorial(n - 1);
   }
 
killedBy: Calculator factorial should calculate factorial of 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1.5

[Timeout] ArithmeticOperator
src/calculator/calculator.ts:28:31
   factorial(n: number): number {
     if (n < 0) throw new Error('Negative numbers not allowed');
     if (n === 0) return 1;
-    return n * this.factorial(n - 1);
+    return n * this.factorial(n + 1);
   }
 

[Killed] BlockStatement
src/calculator/calculator.ts:31:49
     return n * this.factorial(n - 1);
   }
 
-  power(base: number, exponent: number): number {
-    return Math.pow(base, exponent);
-  }
+  power(base: number, exponent: number): number {}
 }
killedBy: Calculator power should calculate power correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined
